#!/usr/bin/env python
# -*- coding: utf-8 -*-
import pandas as pd

from anyway import field_names

import logging

logger = logging.getLogger("localizations")

_tables = {
    "SUG_DEREH": {
        1: "עירוני לא בצומת",
        2: "עירונית בצומת",
        3: "לא עירוני לא בצומת",
        4: "לא-עירונית בצומת",
    },
    "SUG_YOM": {1: "חג", 2: "ערב חג", 3: "חול המועד", 4: "יום מיוחד/אחר", 5: "יום רגיל"},
    "HUMRAT_TEUNA": {1: "קטלנית", 2: "קשה", 3: "קלה"},
    "SUG_TEUNA": {
        1205: "התנגשות חזית באחור",
        1206: "התנגשות צד בצד",
        1207: "התנגשות חזית בחזית",
        1208: "התנגשות עם רכב שנעצר",
        1209: "התנגשות עם רכב חונה",
        1210: "התנגשות עם עצם דומם",
        1211: "ירידה מהכביש",
        1212: "התהפכות",
        1213: "החלקה",
        1214: "פגיעה בנוסע רכב",
        1215: "נפילה מרכב נע",
        1216: "שריפה",
        1217: "פגיעה ממטען",
        1219: "התנגשות אחור חזית",
        1220: "התנגשות אחור צד",
        1221: "התנגשות בבעל חיים",
        1222: "התנגשות באחר",
        1369: "פגיעה בהולך רגל",
        1370: "התנגשות חזית אל צד",
        1738: "התנגשות אחור באחור",
        0: "אחר",
    },
    "HAD_MASLUL": {
        759: "חד סטרית",
        760: "דו סטרי +קו הפרדה רצוף",
        761: "דו סטרי אין קו הפרדה",
        762: "אחר",
    },
    "RAV_MASLUL": {
        763: "מיפרדה מסומנת בצבע",
        764: "מיפרדה עם גדר בטיחות",
        765: "מיפרדה בנויה ללא גדר בטיחות",
        766: "מיפרדה לא בנויה",
        767: "אחר",
    },
    "MEHIRUT_MUTERET": {
        768: 'עד 50 קמ"ש',
        769: 'עד 60 קמ"ש',
        773: 'עד 70 קמ"ש',
        774: 'עד 80 קמ"ש',
        775: 'עד 90 קמ"ש',
        776: 'עד 100 קמ"ש',
        1233: 'עד 110 קמ"ש',
        3383: 'עד 120 קמ"ש',
        5955: 'עד 30 קמ"ש',
    },
    "TKINUT": {
        1998: "אין ליקוי",
        1999: "כביש משובש",
        2000: "שוליים גרועים",
        2001: "שוליים גרועים וכביש משובש",
    },
    "ROHAV": {
        777: "עד 5",
        778: "5 עד 7",
        779: "7 עד 10.5",
        780: "10.5 עד 14",
        781: "יותר מ 14",
    },
    "TEURA": {
        1239: "יום-אור רגיל",
        1240: "יום -ראות מוגבלת עקב מזג אוויר",
        1241: "יום-לא ידוע",
        1242: "לילה- פעלה תאורה במקום",
        1243: "לילה - תאורה לא פעלה",
        1244: "לילה- לא קיימת תאורה במקום",
        1245: "לילה - לא ידוע",
        1246: "לילה - תאורה עם ראות מוגבלת עקב מזג אוויר",
        1247: "לילה - תאורה לא תקינה עם ראות מוגבלת עקב מזג אוויר",
        1248: "לילה - ללא תאורה עם ראות מוגבלת עקב מזג האוויר",
        1249: "דמדומים",
    },
    "BAKARA": {
        1250: "ללא רמזור/תמרור",
        1251: "רמזור תקין",
        1252: "רמזור מהבהב צהוב",
        1254: "תמרור עצור",
        1255: "תמרור זכות קדימה",
        1256: "אחר",
        1440: "תמרור מעגל תנועה",
    },
    "MEZEG_AVIR": {
        805: "נאה",
        806: "גשום",
        807: "שרבי",
        808: "ערפילי",
        809: "אחר",
        1461: "שלג",
        2902: "ברד",
        2903: "אובך",
        2904: "מעונן",
    },
    "PNE_KVISH": {
        814: "יבש",
        815: "רטוב ממים",
        816: "מרוח בחומר",
        817: "מכוסה בבוץ",
        818: "חול או חצץ על הכביש",
        819: "אחר",
        2905: "מכוסה בחומר מחליק",
    },
    "SUG_EZEM": {
        821: "עץ",
        822: "עמוד חשמל/תאורה/טלפון",
        823: "תמרור ושלט",
        824: "גשר-סימניו ומגיניו",
        825: "מבנה",
        826: "גדר בטיחות לרכב",
        827: "חבית",
        828: "אחר",
    },
    "MERHAK_EZEM": {
        1261: "עד מטר",
        1262: "1-3 מטר",
        1263: "על הכביש",
        1264: "על שטח ההפרדה",
        1462: "מעל 3 מטר",
    },
    "LO_HAZA": {
        1076: "הלך בכיוון בתנועה",
        1077: "הלך נגד כיוון התנועה",
        1078: "שיחק על הכביש",
        1079: "היה על אי הפרדה",
        1080: "היה על השוליים / מדרכה",
        1081: "אחר",
        1082: "לא ידוע אם חצה",
        1392: "עמד על הכביש",
    },
    "OFEN_HAZIYA": {
        1064: "התפרץ אל הכביש",
        1065: "חצה שהוא מוסתר",
        1066: "חצה רגיל",
        1067: "אחר",
        2188: "לא חצה",
        2189: "לא ידוע אם חצה",
    },
    "MEKOM_HAZIYA": {
        1068: "לא במעבר - ליד צומת",
        1069: "לא במעבר - לא ליד צומת",
        1070: "במעבר חצייה בלי רמזור",
        1071: "במעבר חצייה עם רמזור",
        1072: "לא ידוע מקום החצייה",
    },
    "KIVUN_HAZIYA": {1073: "מימין לשמאל", 1074: "משמאל לימין"},
    "STATUS_IGUN": {
        1: "עיגון מדויק",
        2: "מרכז ישוב",
        3: "מרכז דרך",
        4: "מרכז קילומטר",
        9: "לא עוגן",
    },
}

_fields = {
    "pk_teuna_fikt": "מזהה",
    "SUG_DEREH": "סוג דרך",
    "SHEM_ZOMET": "שם צומת",
    "SEMEL_YISHUV": "ישוב",  # from dictionary
    "REHOV1": "רחוב 1",  # from dicstreets (with SEMEL_YISHUV)
    "REHOV2": "רחוב 2",  # from dicstreets (with SEMEL_YISHUV)
    "BAYIT": "מספר בית",
    "ZOMET_IRONI": "צומת עירוני",  # from intersect urban dictionary
    "KVISH1": "כביש 1",  # from intersect urban dictionary
    "KVISH2": "כביש 2",  # from intersect urban dictionary
    "ZOMET_LO_IRONI": "צומת לא עירוני",  # from non urban dictionary
    "SUG_YOM": "סוג יום",
    "RAMZOR": "רמזור",
    "HUMRAT_TEUNA": "חומרת תאונה",
    "SUG_TEUNA": "סוג תאונה",
    "HAD_MASLUL": "חד מסלול",
    "RAV_MASLUL": "רב מסלול",
    "MEHIRUT_MUTERET": "מהירות מותרת",
    "TKINUT": "תקינות",
    "ROHAV": "רוחב",
    "TEURA": "תאורה",
    "BAKARA": "בקרה",
    "MEZEG_AVIR": "מזג אוויר",
    "MEZEG_AVIR_UNITED": "מזג אוויר",
    "PNE_KVISH": "פני כביש",
    "SUG_EZEM": "סוג עצם",
    "MERHAK_EZEM": "מרחק עצם",
    "LO_HAZA": "לא חצה",
    "OFEN_HAZIYA": "אופן חציה",
    "MEKOM_HAZIYA": "מקום חציה",
    "KIVUN_HAZIYA": "כיוון חציה",
    "STATUS_IGUN": "עיגון",
    "MAHOZ": "מחוז",
    "NAFA": "נפה",
    "EZOR_TIVI": "אזור טבעי",
    "MAAMAD_MINIZIPALI": "מעמד מוניציפלי",
    "ZURAT_ISHUV": "צורת יישוב",
    "VEHICLE_TYPE": "סוג רכב",
    "VIOLATION_TYPE": "סוג עבירה",
    "RSA_LICENSE_PLATE": "סוג לוחית רישוי",
}

try:
    _cities = pd.read_csv("static/data/cities.csv", encoding="utf-8", index_col=field_names.sign)
except FileNotFoundError:
    pass


def get_field(field, value=None):
    if value:
        table = _tables.get(field, None)
        return table.get(value, None) if table else None

    return _fields.get(field, None)


def get_supported_tables():
    return _tables.keys()
