Repository: data-for-change/anyway
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: he

source: killed
he: הרוג/ה

source: severe injured
he: פצוע/ה קשה

source: light injured
he: פצוע/ה קל

source: Pedestrian
he: הולך רגל

source: Driver of a vehicle with 4 wheel or more
he: נהג ברכב עם 4 גלגלים או יותר

source: Passenger of a vehicle with 4 wheel or more
he: נוסע ברכב עם 4 גלגלים או יותר

source: Motorcycle driver
he: נהג באופנוע

source: Motorcycle passenger
he: נוסע באופנוע

source: Bicycle driver
he: נהג אופניים

source: Bicycle passenger
he: נוסע באופניים

source: Driver of an unknown vehicle
he: נהג ברכב לא ידוע

source: Passenger of an unknown vehicle
he: נוסע ברכב לא ידוע

source: fatal
he: קטלנית

source: severe
he: קשה

source: light
he: קלה

source: Pedestrian injury
he: פגיעה בהולך רגל

source: Collision of front to side
he: התנגשות חזית אל צד

source: Collision of front to rear-end
he: התנגשות חזית באחור

source: Collision of side to side (lateral)
he: התנגשות צד בצד

source: Head-on frontal collision
he: התנגשות חזית בחזית

source: Collision with a stopped non-parked vehicle
he: התנגשות עם רכב שנעצר ללא חניה

source: Collision with a parked vehicle
he: התנגשות עם רכב חונה

source: Collision with an inanimate object
he: התנגשות עם עצם דומם

source: Swerving off the road or onto the pavement
he: ירידה מהכביש או עלייה למדרכה

source: Overturned vehicle
he: התהפכות

source: Skid
he: החלקה

source: Injury of a passenger in a vehicle
he: פגיעה בנוסע בתוך כלי הרכב

source: A fall from a moving vehicle
he: נפילה מרכב נע

source: Fire
he: שריפה

source: Other
he: אחר

source: Collision of rear-end to front
he: התנגשות אחור אל חזית

source: Collision of rear-end to side
he: התנגשות אחור אל צד

source: Collision with an animal
he: התנגשות עם בעל חיים

source: Damage caused by a falling load off a vehicle
he: פגיעה ממטען של רכב

source: Day
he: יום

source: Night
he: לילה

source: professional_driver
he: נהג מקצועי

source: private_vehicle_driver
he: נהג רכב פרטי

source: other_driver
he: אחר

source: private car
he: רכב נוסעים פרטי

source: truck upto 3.5 tons
he: טרנזיט עד 3.5 טון

source: pickup upto 3.5 tons
he: פיקאפ עד 3.5 טון

source: truck 4 to 10 tons
he: משאית 4 עד 10 טון

source: truck 12 to 16 tons
he: משאית 12 עד 16 טון

source: truck 16 to 34 tons
he: משאית 16 עד 34 טון

source: truck above 34 tons
he: משאית מעל 34 טון

source: motorcycle upto 50 cc
he: אופנוע עד 50 סמ"ק

source: motorcycle 50 to 250 cc
he: אופנוע 50 עד 250 סמ"ק

source: motorcycle 250 to 400 cc
he: אופנוע 250 עד 400 סמ"ק

source: bus
he: אוטובוס

source: taxi
he: מונית

source: work vehicle
he: רכב עבודה

source: tractor
he: טרקטור

source: bike
he: אופניים רגילים

source: train
he: רכבת

source: other and unknown
he: אחר ולא ידוע

source: minibus
he: מיניבוס

source: motorcycle above 400 cc
he: אופנוע מעל 400 סמ"ק

source: electric scooter
he: קורקינט חשמלי

source: mobility scooter
he: קלנועית חשמלית

source: electric bike
he: אופניים חשמליים

source: truck 3.5 to 10 tons
he: משאית 3.5 עד 10 טון

source: truck 10 to 12 tons
he: משאית 10 עד 12 טון

source: professional driver
he: נהג מקצועי

source: private driver
he: נהג רכב פרטי

source: light electric vehicles
he: רכבים חשמליים קלים

source: large vehicle
he: מסחרי/משאית

source: motorcycle
he: אופנוע

source: bicycle and small motor vehicles
he: אופניים/קורקינט

source: other vehicle
he: רכב אחר

source: in
he: ב

source: Number of accidents by accident type
he: מספר תאונות לפי סוג

source: Collision
he: התנגשות

source: Distribution of accidents by type in the selected segment and time period. Three most common accident types are displayed
he: התפלגות תאונות לפי סוג התאונה במקטע, בפרק הזמן הנבחר. מוצגים 3 סוגי התאונות הנפוצים ביותר במקום זה

source: Number of accidents, per year, split by severity
he: מספר תאונות לפי שנה, לפי חומרה

source: Fatal, severe and light accidents count in the specified years, split by accident severity
he: כמות התאונות הקטלניות, הקשות והקלות במקטע, לפי שנת התאונה, מחולק לפי חומרת התאונה, בפרק הזמן הנבחר.

source: Accidents by time
he: תאונות על פי זמן

source: Distribution of accidents by day/night. Day/night are determined by sunrise and sunset at each day of the year.
he: התפלגות התאונות ביום ובלילה. היום והלילה נקבעים לפי זריחת השמש ושקיעתה בכל יום בשנה

source: one light
he: קלה אחת

source: light plural
he: קלות

source: one severe
he: קשה אחת

source: severe plural
he: קשות

source: one fatal
he: קטלנית אחת

source: fatal plural
he: קטלניות

source: in yishuv
he: ביישוב

source: in street
he: ברחוב

source: in road
he: בכביש

source: in segment
he: במקטע

source: between the years
he: בין השנים

source: took place
he: התרחשו

source: accidents
he: תאונות

source: out of them (feminine)
he: מתוכן

source: and
he: ו-

source: Number of accidents by severity
he: מספר תאונות לפי חומרה

source: Fatal, severe and light accidents count in
he: כמות התאונות הקטלניות, הקשות והקלות ב

source: segment
he: מקטע

source: junction
he: צמת

source: in the selected time
he: בפרק הזמן הנבחר

source: in years
he: בשנים

source: street
he: רחוב

source: All accidents heat map
he: מפת חום של מוקדי התאונות

source: All accidents heat map (fatal, severe, light) in location
he: מפת חום עם מוקדי התאונות (קטלניות, קשות, קלות) במיקום הנוכחי

source: Number of injured in accidents, per year, split by severity
he: מספר נפגעים לפי שנה, לפי חומרה

source: Fatal, severe and light injured count in the specified years, split by injury severity
he: מספר הרוגים, פצועים קשה וקל, לפי שנה במקטע, מחולק לפי חומרת הפגיעה, בפרק הזמן הנבחר.

source: one light injured
he: פצוע/ה קל

source: light injured plural
he: פצועים/ות קל

source: one severe injured
he: פצוע/ה קשה

source: severe injured plural
he: פצועים קשה

source: one killed
he: הרוג

source: killed plural
he: הרוגים

source: injured/killed
he: נפצעו/נהרגו

source: people from car accidents
he: אנשים מתאונות דרכים

source: out of them (masculine plural)
he: מתוכם

source: Number of Injuries in accidents by severity
he: מספר תאונות לפי חומרה

source: Fatal, severe and light injuries count in
he: כמות ההרוגים, פצועים קשה ופצועים קל ב

source: Killed and injury stacked per age group
he: חומרת פגיעה לפי קבוצת גיל

source: Injured count per age group and injurey severity. The graph shows all injury severities: fatal, severe, and light.
he: כמות נפגעים לפי קבוצת גיל וחומרת פגיעה. הגרף מראה את כל חומרות הפגיעה: הרוגים, פצועים קשה ופצועים קל.

source: Injury per age group
he: נפגעים לפי קבוצת גיל

source: Injured count per age group. The graph shows all injury severities: fatal, severe, and light.
he: כמות נפגעים לפי קבוצת גיל. הגרף מראה את כל חומרות הפגיעה: הרוגים, פצועים קשה ופצועים קל.

source: unknown
he: לא ידוע

source: Killed and injured stacked per vehicle type
he: חומרת פגיעה לפי סוג הרכב

source: Injured count per vehicle type and injury severity. The graph shows all injury severities: fatal, severe, and light.
he: כמות נפגעים לפי סוג הרכב וחומרת פגיעה. הגרף מראה את כל חומרות הפגיעה: הרוגים, פצועים קשה ופצועים קל.

source: Severe accidents
he: תאונות חמורות

source: latest severe accident took place
he: תאונה חמורה אחרונה התרחשה

source: latest severe accidents took place
he: תאונות חמורות אחרונות התרחשו

source: in date
he: בתאריך

source: in hour
he: בשעה

source: occured accident
he: התרחשה תאונה

source: of type
he: מסוג

source: accident_severity
he: חומרת תאונה

source: type
he: סוג

source: Most recent fatal and severe accidents, ordered by date. Up to 10 accidents are presented.
he: התאונות החמורות (קשות וקטלניות) האחרונות, מסודרות לפי תאריך בסדר יורד. מוצגות עד 10 תאונות.

source: Severe accidents in suburban junction
he: תאונות חמורות בצמת בינעירוני

source: Most severe accidents in segment
he: תאונות חמורות במקטע

source: Severe accidents in street
he: תאונות חמורות ברחוב

source: injured
he: פצועים

source: Most recent fatal and severe accidents displayed on a map. Up to 10 accidents are presented.
he: התאונות החמורות (קשות וקטלניות) האחרונות מוצגות על גבי מפה. מוצגות עד 10 תאונות.

source: Severely injured or killed in bike, e-bike, or scooter accidents
he: רוכבי אופניים וקורקינט שנפגעו קשה או נהרגו

source: Number of severely injured or killed in bike, e-bike, or scooter accidents
he: מספר נפגעים שנפצעו קשה או נהרגו בתאונות אופנים, אופנים חשמליים וקורקינט

source: Main principles in zero vision's bike transportation development
he: עקרונות עיקריים בפיתוח תחבורת אופניים על פי חזון אפס

source: Comparing vehicle type in accidents relative to national average
he: השוואת אחוז הרכבים בתאונות במקטע {} לעומת ממוצע ארצי

source: Vehicle accidents by type in specific segment, sorted by segment, compared to the national average
he: תאונות רכבים לפי סוג במקטע, מסודרים לפי מקטע, בהשוואה לממוצע הארצי

source: driver_type
he: סוג נהג

source: Number of accidents by driver type
he: מספר תאונות לפי סוג הנהג

source: Driver involvement in accident by driver type: professional - trucks, taxi, bus, work, minibus, tractor, private - private car, motorcycle, light electric - electric scooter, mobility scooter, electric bike.
he: מעורבות נהגים בתאונות לפי סוג נהג: מקצועי - משאיות, מוניות, אוטובוס, רכב עבודה, מיניבוס, טרקטור, נהג פרטי - רכב פרטי, אופנוע, חשמלי קל - קלנועית, קורקינט ואופניים חשמליים.

source: Number of accidents by hour
he: מספר תאונות לפי שעה

source: Number of accidents by road light
he: מספר תאונות לפי תאורה

source: Monthly killed in accidents on year over compared for current month in previous years
he: כמות ההרוגים בתאונות דרכים בחודש הנוכחי בהשוואה לשנים קודמות

source: others
he: אחרות

source: front side
he: חזית-צד

source: Front-side vs other accidents
he: תאונות חזית-צד מול סוגי תאונה אחרים

source: Fatal & severe accidents of type front-to-side in this road segment
he: תאונה קטלנית או חמורה מסוג חזית-צד בקטע כביש זה

source: fatal accidents
he: תאונות קטלניות

source: severe accidents
he: תאונות חמורות

source: Fatal head on collisions vs other accidents
he: תאונות קטלניות לפי סוג

source: desc
he: תאור

source: frontal
he: חזיתיות

source: Fatal accidents distribution by accident type - head on collisions vs other accidents.
he: התפלגות התאונות הקטלניות לפי סוג, תאונות חזיתיות מול סך התאונות האחרות.

source: all roads
he: כל הכבישים

source: Fatal and severe motorcycle accidents on road
he: תאונות אופנוע קטלניות בכביש

source: compared to rest of country
he: בהשוואה לשאר הארץ

source: road
he: כביש

source: Road 2 plus 1 solution to prevent fatal accidents
he: פתרון כביש 2 פלוס 1 למניעת תאונות קטלניות

source: Pedestrian injury comparison
he: פגיעות בהולכי רגל על

source: Segments with most accidents per Km
he: מקטעים עם הכי הרבה תאונות לק"מ

source: road1
he: כביש

source: Severe and fatal accidents per Km by section in road
he: תאונות קטלניות וקשות לכל קילומטר לפי מקטע בכביש

source: Segments with most accidents
he: מקטעים עם הכי הרבה תאונות

source: Pedestrian accidents by severity and year
he: תאונות הולכי רגל לפי חומרה ולפי שנה

source: Severe or fatal accidents on bikes, e-bikes, or scooters
he: רוכבי אופנים, אופנים חשמליים, וקורקינט חשמלי שנפצעו קשה או נהרגו ב

source: street1_hebrew
he: רחוב

source: A speed limit solution on an urban road by vizion zero
he: פתרונות הגבלת מהירות בדרך עירונית על פי חזון אפס

source: ANYWAY - Making a difference in any way
he: ANYWAY - משפיעים בכל דרך

source: Login
he: התחבר

source: log in
he: התחבר
